In [ ]:
import numpy
import pandas as pd
needed = float(input())

10.2

Пользователь вводит значение, которое будет являться индексом.

In [ ]:
def create_data():
    return (pd.DataFrame({'city': ['Moscow', 'London', 'London', 'Kiev', 'Moscow', 'Moscow', 'Kiev','Moscow'], 'income': [10.2, 11.6, 8.8, 9.0, 6.6, 10.0, 9.0, 7.2]}))

Обрабатываем многомерные данные и организовываем их в датафрейм с помощью библиотеки Pandas

In [ ]:
data = create_data()
data

     city  income
0  Moscow    10.2
1  London    11.6
2  London     8.8
3    Kiev     9.0
4  Moscow     6.6
5  Moscow    10.0
6    Kiev     9.0
7  Moscow     7.2

In [ ]:
cities = data['city']
indexes = data['income']
for i in range(len(indexes)):
  if indexes[i] == needed:
    print(cities[i])

Moscow

По введенному индексу находим нужное нам категориальное значение и выводим его.